Repository: Jephry27/bridgeacademyhaiti
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: English
fr: Anglais

source: French
fr: Français

source: WELCOME TO BRIDGE ACADEMY HAITI
fr: BIENVENUE SUR BRIDGE ACADEMY HAITI

source: ACADEMICS
fr: ACADEMIQUE

source: Bridge Academy is a first through twelfth grade, private, bilingual, and secular school. The goal of Bridge Academy’s learning program is to nurture and cultivate our students to become independent leaders in their community through the use of a dynamic and supportive curriculum...
fr: Bridge Academy est une école privée, bilingue et laïque, qui accueille des élèves de la première à la douzième année. Le programme d’apprentissage de Bridge Academy a pour objectif de former ses élèves à devenir des leaders indépendants dans leur communauté grâce à l’utilisation d’un programme d’études dynamique et soutenu...

source: Our Program
fr: Notre Programme

source: OUR PROGRAM
fr: NOTRE PROGRAMME

source: Music and Art
fr: Musique et Art

source: MUSIC AND ART
fr: MUSIQUE ET ART

source: Athletics
fr: Éducation physique et sportive

source: ATHLETICS
fr: EDUCATION PHYSIQUE ET SPORTIVE

source: Our curriculum meets rigorous standards set by Bridge Academy and the state of Texas through the Texas Tech University Independent School District (TTUISD) program. Students have the opportunity to pair an American education with the existing Bridge curriculum; they participate in a bilingual, dual-diploma program at the end of which they will earn an accredited and competitive US high school diploma.
fr: Notre programme d’études répond aux normes rigoureuses établies par Bridge Academy et l’État du Texas dans le cadre du programme TTUISD (Texas Tech University Independent School District). Les élèves ont l’opportunité d’associer une éducation américaine au programme de Bridge Academy. Ils bénéficient d’un programme bilingue, au terme duquel ils obtiendront un diplôme américain accrédité et compétitif.

source: About our program
fr: Notre programme

source: At Bridge Academy we view discipline as a part of human development. Teachers and staff members are encouraged to use positive reinforcement. However, students are expected to use self-control, self-discipline and to follow rules and guidelines. When necessary, disciplinary actions are taken in such a way as to enhance personal growth and to uphold a sense of fairness.
fr: À Bridge Academy, la discipline fait partie du développement humain. Les enseignants et les membres du personnel sont encouragés à utiliser le renforcement positif. Cependant, les élèves sont censés faire preuve de maîtrise de soi et de discipline et se conformer aux règles et directives.

source: Literacy
fr: Compétences de la langue et du langage

source: Our literacy program provides differentiated instruction that aims to target the learning needs and potential of students. It aims to help students with an understanding of the importance of what they are learning in school so that they may apply it beyond school. It also helps students to decipher their strengths and identify where they need to improve.
fr: Notre programme propose un enseignement différencié visant à cibler les besoins et le potentiel d'apprentissage de chaque élève. Il vise à aider les élèves à comprendre l’importance de l’apprentissage scolaire pour leur vie future. Il les aide également à découvrir leurs forces de même qu’à identifier les domaines dans lesquels ils doivent s’améliorer.

source: Our literacy program includes our French and English courses geared towards learners of the language throughout the primary and secondary curriculum. It also encompasses our language electives, French and Spanish in high school, and activities that are designed to raise literacy in all of our courses.
fr: Notre programme de langue et du langage comprend nos cours de français et d'anglais destinés aux apprenants de la langue tout au long du cursus primaire et secondaire. Il englobe également nos cours électifs de langue, le français et l'espagnol à l'école secondaire, et les activités qui visent à accroître la compétence langagière dans tous nos cours.

source: Our Research Skills course provides the knowledge and practice necessary to complete effective inquiry. The goal of this course is to teach our students how to be digitally responsible and to provide students with an understanding of the economic, legal, and social issues surrounding the use and access of information ethically and legally.
fr: Notre cours d’introduction à la recherche vise à fournir aux élèves les connaissances et la pratique nécessaires pour mener à bien une recherche efficace. L'objectif de ce cours est d'enseigner à nos élèves à être numériquement responsables et leur fournir une meilleure compréhension des enjeux économiques, juridiques et sociaux liés à l'utilisation et à l'accès à l'information, aux niveaux éthique et légal.

source: In the high school, our students follow a standard-based curriculum through the state of Texas and students must take an End of Course (EOC) exam prescribed by the state in order to meet the requirements of a Texas high school diploma.
fr: Au high school, nos élèves suivent un programme standardisé basé dans l'état du Texas et doivent passer un examen de fin de cours (EOC) prescrit par l'État afin de satisfaire aux exigences d'un diplôme de high school au Texas.

source: Resource Room
fr: Espace de ressources et d’apprentissage

source: Students with special academic needs whether accelerated or self-paced are provided with differentiated assistance in the form of Individualized Educational Plan (IEP), within a separate and structured space known as Resource Room. In this setting, students benefit from one-on-one attention in order for them to work at their own pace and to succeed within their own abilities.
fr: Le Ressource Room est un lieu distinct où un programme d’études spécial peut être offert à un élève présentant des difficultés d’apprentissage ou surdoué, individuellement ou en petit groupe. Au sein d’un espace structuré, les élèves ayant des besoins académiques spéciaux bénéficient d’une assistance différenciée sous la forme d’un plan pédagogique individualisé (IEP).

source: Bridge Academy understands the importance of STEM Ed in student development. STEM is a program that forms students in four specific disciplines: science, technology, engineering, and mathematics. Our STEM program aims to help students develop their critical and problem solving skills. Students are taught the importance and the application of the scientific method, which is central to creating a community of future inventors, investigators, and problem solvers.
fr: Bridge Academy comprend l’importance de STEM ED dans le développement de l’élève. STEM est un programme qui a pour objectif de former les élèves dans quatre disciplines spécifiques: sciences, technologie, ingénierie et mathématiques, dans le cadre d’une approche interdisciplinaire et appliquée. Notre programme STEM vise à aider nos élèves à développer leurs compétences critiques et à résoudre des problèmes.

source: Students participate in hands-on, inquiry-based learning activities such as experiments in our laboratory, Open Courseware programs such as virtual labs, problem-based learning, math and physics, and technology activities in our computer labs.
fr: Les élèves apprennent l’importance et l’application de la méthode scientifique, essentielle à la création d’une communauté de futurs inventeurs, chercheurs et spécialistes en résolution de problèmes. Ils participent à des activités pratiques et d’investigations, telles que des expériences dans notre laboratoire, des didacticiels libres, des laboratoires virtuels, l’apprentissage basé sur la résolution de problèmes en mathématiques et physique et des activités technologiques diverses dans notre laboratoire informatique.

source: Our music and art curriculum enriches learning and provides students the setting to practically apply what they learn in the academic realm.
fr: Notre programme de musique et d’art enrichit l’apprentissage et offre aux élèves un cadre pour appliquer concrètement ce qu’ils apprennent dans la sphère académique.

source: It also affords students the opportunity to learn skills that will make them successful in life. Music and art enhance students’ creativity and boost their social skills. The curriculum includes:
fr: Il leur offre également la possibilité d’acquérir des compétences qui leur permettront de réussir dans la vie. La musique et l'art améliorent la créativité des élèves et stimulent leurs compétences sociales. Le programme comprend:

source: Music history
fr: Histoire de la musique

source: Music theory
fr: Théorie musicale

source: Instruments: recorder, triangle, xylophone, piano
fr: Instruments: flute, triangle, xylophone, piano

source: *optional through afterschool program
fr: *programme optionnel après la journée de classe

source: Social Studies
fr: Sciences Sociales

source: The social studies program requires students to engage in discussions, productive research, interactive debates and analytical and logical reasoning. The main goal of these courses is to provide students with the knowledge and skills to become informed, productive citizens who are able to think critically. Our social studies program covers Haitian, as well as American and world history and geography. This program also encompasses our civics, Haitian studies, Breaking News, and economics courses.
fr: Le programme de sciences sociales encourage les élèves à prendre part à des discussions, à des recherches productives, à des débats interactifs et à développer un raisonnement analytique et logique. L'objectif principal de ces cours est de fournir aux élèves les connaissances et les compétences nécessaires pour devenir des citoyens informés, productifs et capables de pensée critique. Notre programme de sciences sociales couvre l'histoire et la géographie haïtiennes, américaines et mondiales. Ce programme comprend également nos cours d’éducation civique, d’études haïtiennes, d’actualités et d’économie.

source: The goal of Bridge Academy’s athletic program is to encourage sportsmanship, teamwork, and camaraderie among its students. It also enables individuals to develop the knowledge, skills, and attitudes necessary to lead an active, healthy lifestyle.
fr: L'objectif du programme sportif de Bridge Academy est d'encourager chez ses élèves le fairplay, l’esprit d'équipe, et la camaraderie.

source: Our physical Education classes start in first grade. Our middle school and our high school students have opportunities to join a variety of team sports and participate in interscholastic competitions. While we encourage a competitive attitude and instill a desire to win, we dissuade poor sportsmanship as well as behaviors contrary to the Bridge Academy mission.
fr: Les cours d'éducation physique commencent en première année. Nos élèves ont l’opportunité de participer à divers sports d'équipe (volleyball, basketball, football et tennis de table) et à des compétitions interscolaires. Nous encourageons une attitude compétitive et nous inculquons le désir de gagner chez nos élèves, tout en leur recommandant d’éviter un esprit sportif négatif ainsi que des comportements contraires à la vision de Bridge Academy.

source: Our students play volleyball, basketball, soccer, and table tennis.
fr: Nos élèves jouent au volleyball, basketball, football et au tennis de table.

source: Community service/ volunteer work
fr: Service communautaire / Volontariat

source: Volunteering provides the students with social skills and the opportunities to understand their role as members of the community. It also teaches them the value of giving back and is a requirement of their civics program.
fr: Le volontariat permet aux élèves d’acquérir des compétences sociales et leur offre des opportunités de mieux appréhender leur rôle comme membres de leur communauté. Il est une exigence de leur programme de civisme et leur apprend également à donner en retour.

source: Afterschool Program
fr: Tutorat

source: Our afterschool tutoring program not only provides underperforming students with homework assistance but gives students the opportunity to improve on aspects of their lives that may serve as obstacles to their learning such as literacy, study skills, and organizational skills. Tutors work with students individually and in small groups to provide guidance, encouragement as well as academic assistance.
fr: Notre programme de tutorat fournit, après la journée de classe, non seulement une aide aux devoirs à des étudiants moins performants, mais leur donne également la possibilité d'améliorer certains aspects de leur vie qui pourraient constituer des obstacles à leur apprentissage, tels que des déficits en compétences du langage, d'étude et d’organisation. Les tuteurs travaillent avec les élèves individuellement et en petits groupes pour fournir des conseils, des encouragements et une assistance scolaire.

source: Our piano lessons are geared towards beginners and intermediate students. Playing the piano promotes high performance in students, helps them to have a more solid understanding of STEM disciplines, promotes creative thinking, increases diligence, responsibility, concentration, self-esteem, and motor skills.
fr: Nos leçons de piano sont destinées aux élèves débutants et intermédiaires. Jouer du piano favorise une meilleure performance des élèves, les aide à mieux comprendre les disciplines STEM, encourage la pensée créatrice, augmente l’assiduité, la responsabilité, la concentration, l'estime de soi et la motricité.

source: Extracurricular activities
fr: Activités extracurriculaires

source: Extracurricular activities are a worthwhile pursuit. Students who are involved in different activities gain experiences that will help them in college and beyond. They also learn to demonstrate commitment, discipline, and higher performance in their academics.
fr: Les activités extracurriculaires sont un ajout important à notre programme. Les élèves qui participent à différentes activités acquièrent des expériences qui les aideront à l’université et au-delà.

source: Bridge Academy offers diverse club options to the high school students. They choose the activity for which they have a genuine interest: Math and Chess club, Student Council, yearbook, newsletter, board games, art, wellness, and yoga.
fr: Bridge Academy propose aux élèves divers choix de clubs, parmi lesquels mathématiques et échecs, jeux de société, travaux d’art, bien-être et yoga, conseil des élèves, yearbook, bulletin de nouvelles (The Bridge Herald). Les élèves choisissent l’activité pour laquelle ils ont un intérêt réel.

source: Within their participation in clubs, students learn among other skills:
fr: Au sein de ces clubs, les élèves acquièrent les compétences suivantes:

source: Governance and immediate impact on their community
fr: Le sens des responsabilités et l’implication dans leur communauté

source: Public-speaking
fr: L’art oratoire

source: Leadership
fr: Le leadership

source: Negotiation
fr: La négociation

source: Money-management
fr: La gestion des ressources

source: Time-management
fr: La gestion du temps

source: Teamwork
fr: Le travail d’équipe

source: Field trips
fr: Les excursions

source: Throughout the school year, Field trips are organized for all grades. They allow students to connect what they learn in the classrooms to what is happening in the world.
fr: Tout au long de l'année scolaire, des excursions sont organisées pour tous les niveaux. Elles permettent aux élèves de relier ce qu’ils apprennent en classe à ce qui se passe dans leur environnement et dans le monde.

source: Events
fr: Événements spéciaux

source: Bridge Academy organizes traditional events every year to celebrate holidays, and provide students with additional knowledge and skills. Students listen to inspiring speakers and participate in different workshops. The highlights are usually our Career and College Fair, The Health and Fitness Fair, our Thanksgiving dinner celebration, our Christmas party, and the different award ceremonies and graduation.
fr: Bridge Academy organise des événements chaque année pour célébrer les fêtes traditionnelles ou fournir aux élèves des connaissances et des compétences supplémentaires. Les élèves ont l’opportunité d’écouter des conférenciers inspirants et de participer à divers ateliers. Les événements les plus marquants sont généralement le salon des carrières et des universités, le salon de la santé et du bien-être, le dîner de Thanksgiving, la fête de Noël et les différentes cérémonies de remise de distinctions spéciales et de collation de diplômes.

source: Home
fr: Accueille

source: Our program
fr: Notre Programme

source: About
fr: A Propos

source: Mission and Vision
fr: Mission et vision

source: Board of Directors
fr: Conseil de direction

source: Academics
fr: L’académique

source: Language
fr: Langue

source: 1st through 12th Grade
fr: De la 1ère à la 12ème Année

source: Private, Bilingual, and Secular School.
fr: Une école privée, bilingue et laïque
